Tekla Open API Reference for Tekla Structures 2025
Vector Constructor (Point)
 Instatiates a new vector with the given point.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector(
	Point Point
)
Public Sub New (
	Point As Point
)
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be used.
See Also
Reference
Vector Class
Vector Overload
Tekla.Structures.Geometry3d Namespace